<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/1eb4a256-d387-44df-8cc9-0ecdcd4d703b/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_appautoscaling_target.ecs_target will be updated in-place
  ~ resource "aws_appautoscaling_target" "ecs_target" {
        id                 = "service/staging_keyserver_cluster/staging_keyserver-service"
      ~ role_arn           = "arn:aws:iam::898587786287:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> "arn:aws:iam::898587786287:role/staging_keyserver-ecs-scale-application"
        # (5 unchanged attributes hidden)
    }

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging_keyserver_cluster/staging_keyserver-service"
        name                               = "staging_keyserver-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_keyserver:62" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task must be replaced
-/+ resource "aws_ecs_task_definition" "app_task" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_keyserver:61" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "staging_keyserver" -> (known after apply)
      ~ revision                 = 61 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.keystore_docdb.aws_docdb_cluster.docdb_primary must be replaced
-/+ resource "aws_docdb_cluster" "docdb_primary" {
      + apply_immediately               = (known after apply)
      ~ arn                             = "arn:aws:rds:eu-central-1:898587786287:cluster:staging-keyserver-keystore-docdb-primary-cluster" -> (known after apply)
      ~ availability_zones              = [
          - "eu-central-1a",
          - "eu-central-1b",
          - "eu-central-1c",
        ] -> (known after apply)
      + cluster_identifier_prefix       = (known after apply)
      ~ cluster_members                 = [
          - "staging-keyserver-keystore-docdb-primary-instance-0",
        ] -> (known after apply)
      ~ cluster_resource_id             = "cluster-IHQNJWC63NKRELS7LEYFYOE5KE" -> (known after apply)
      ~ db_cluster_parameter_group_name = "default.docdb5.0" -> (known after apply)
      ~ db_subnet_group_name            = "staging-keyserver-keystore-docdb-private-subnet-group" -> "staging-keyserver-keystore-docdb-new-private-subnet-group" # forces replacement
      - deletion_protection             = false -> null
      ~ endpoint                        = "staging-keyserver-keystore-docdb-primary-cluster.cluster-cnkvjbadm57i.eu-central-1.docdb.amazonaws.com" -> (known after apply)
      ~ engine_version                  = "5.0.0" -> (known after apply)
      ~ hosted_zone_id                  = "Z1ZKU8ZZR6T7FW" -> (known after apply)
      ~ id                              = "staging-keyserver-keystore-docdb-primary-cluster" -> (known after apply)
      ~ preferred_backup_window         = "22:12-22:42" -> (known after apply)
      ~ preferred_maintenance_window    = "sat:21:17-sat:21:47" -> (known after apply)
      ~ reader_endpoint                 = "staging-keyserver-keystore-docdb-primary-cluster.cluster-ro-cnkvjbadm57i.eu-central-1.docdb.amazonaws.com" -> (known after apply)
      - tags                            = {} -> null
      ~ vpc_security_group_ids          = [
          - "sg-01de29cd9149d5d29",
        ] -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.keystore_docdb.aws_docdb_cluster_instance.docdb_instances[0] must be replaced
-/+ resource "aws_docdb_cluster_instance" "docdb_instances" {
      + apply_immediately            = (known after apply)
      ~ arn                          = "arn:aws:rds:eu-central-1:898587786287:db:staging-keyserver-keystore-docdb-primary-instance-0" -> (known after apply)
      ~ availability_zone            = "eu-central-1c" -> (known after apply)
      ~ ca_cert_identifier           = "rds-ca-2019" -> (known after apply)
      ~ cluster_identifier           = "staging-keyserver-keystore-docdb-primary-cluster" # forces replacement -> (known after apply) # forces replacement
      ~ db_subnet_group_name         = "staging-keyserver-keystore-docdb-private-subnet-group" -> (known after apply)
      ~ dbi_resource_id              = "db-GF34S7DWNQQBQUS4WCMKJKNQSA" -> (known after apply)
      ~ endpoint                     = "staging-keyserver-keystore-docdb-primary-instance-0.cnkvjbadm57i.eu-central-1.docdb.amazonaws.com" -> (known after apply)
      ~ engine_version               = "5.0.0" -> (known after apply)
      ~ id                           = "staging-keyserver-keystore-docdb-primary-instance-0" -> (known after apply)
      + identifier_prefix            = (known after apply)
      ~ kms_key_id                   = "arn:aws:kms:eu-central-1:898587786287:key/49f8d68a-cc29-477d-bdf4-7a9c3597566e" -> (known after apply)
      ~ port                         = 27017 -> (known after apply)
      ~ preferred_backup_window      = "22:12-22:42" -> (known after apply)
      ~ preferred_maintenance_window = "fri:02:49-fri:03:19" -> (known after apply)
      ~ publicly_accessible          = false -> (known after apply)
      ~ storage_encrypted            = true -> (known after apply)
      - tags                         = {} -> null
      ~ writer                       = true -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.keystore_docdb.aws_docdb_subnet_group.new_private_subnets will be created
  + resource "aws_docdb_subnet_group" "new_private_subnets" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "staging-keyserver-keystore-docdb-new-private-subnet-group"
      + name_prefix = (known after apply)
      + subnet_ids  = [
          + "subnet-0851c91f1a82ece18",
          + "subnet-0f59998ee3eeb6b29",
          + "subnet-0fe665bde6c07d332",
        ]
      + tags_all    = {
          + "Application"      = "keyserver"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
    }

  # module.keystore_docdb.aws_docdb_subnet_group.private_subnets will be updated in-place
  ~ resource "aws_docdb_subnet_group" "private_subnets" {
        id          = "staging-keyserver-keystore-docdb-private-subnet-group"
        name        = "staging-keyserver-keystore-docdb-private-subnet-group"
      ~ subnet_ids  = [
          - "subnet-0851c91f1a82ece18",
          - "subnet-0f59998ee3eeb6b29",
          - "subnet-0fe665bde6c07d332",
          + "subnet-006f9fc131af3565e",
          + "subnet-05894f2d41c0e8b45",
          + "subnet-06557bf48886434f1",
        ]
        tags        = {}
        # (3 unchanged attributes hidden)
    }

  # module.keystore_docdb.aws_security_group.new_service_security_group will be created
  + resource "aws_security_group" "new_service_security_group" {
      + arn                    = (known after apply)
      + description            = "Allow ingress from the application"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "Allow outbound traffic from the DocDB cluster"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "Allow inbound traffic to the DocDB cluster"
              + from_port        = 27017
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 27017
            },
        ]
      + name                   = "staging-keyserver-keystore-docdb-service"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Application"      = "keyserver"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
      + vpc_id                 = "vpc-08d4ffa8940e11aa5"
    }

  # module.keystore_docdb.aws_security_group.service_security_group must be replaced
-/+ resource "aws_security_group" "service_security_group" {
      ~ arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-01de29cd9149d5d29" -> (known after apply)
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/16",
                ]
              - description      = "Allow outbound traffic from the DocDB cluster"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "10.192.0.0/16",
                ]
              + description      = "Allow outbound traffic from the DocDB cluster"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      ~ id                     = "sg-01de29cd9149d5d29" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/16",
                ]
              - description      = "Allow inbound traffic to the DocDB cluster"
              - from_port        = 27017
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 27017
            },
          + {
              + cidr_blocks      = [
                  + "10.192.0.0/16",
                ]
              + description      = "Allow inbound traffic to the DocDB cluster"
              + from_port        = 27017
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 27017
            },
        ]
        name                   = "staging-keyserver-keystore-docdb-service"
      + name_prefix            = (known after apply)
      ~ owner_id               = "898587786287" -> (known after apply)
      - tags                   = {} -> null
      ~ vpc_id                 = "vpc-08d4ffa8940e11aa5" -> "vpc-09dce0b23af575478" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keystore_docdb.module.docdb-autoscaling.aws_cloudwatch_metric_alarm.main[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "main" {
      ~ dimensions                = {
          - "DBClusterIdentifier" = "staging-keyserver-keystore-docdb-primary-cluster"
        } -> (known after apply)
        id                        = "staging-keyserver-docdb-autoscaling-0"
        tags                      = {}
        # (16 unchanged attributes hidden)
    }

  # module.keystore_docdb.module.docdb-autoscaling.aws_lambda_function.main will be updated in-place
  ~ resource "aws_lambda_function" "main" {
        id                             = "staging-keyserver-docdb-autoscaling"
        tags                           = {}
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "cluster_identifier" = "staging-keyserver-keystore-docdb-primary-cluster"
              - "max_capacity"       = "6"
              - "min_capacity"       = "0"
            } -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

Plan: 6 to add, 5 to change, 4 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.ecs.aws_appautoscaling_target.ecs_target will be updated in-place%0A  ~ resource "aws_appautoscaling_target" "ecs_target" {%0A        id                 = "service/staging_keyserver_cluster/staging_keyserver-service"%0A      ~ role_arn           = "arn:aws:iam::898587786287:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> "arn:aws:iam::898587786287:role/staging_keyserver-ecs-scale-application"%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_service.app_service will be updated in-place%0A  ~ resource "aws_ecs_service" "app_service" {%0A        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging_keyserver_cluster/staging_keyserver-service"%0A        name                               = "staging_keyserver-service"%0A        tags                               = {}%0A      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_keyserver:62" -> (known after apply)%0A        # (14 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.app_task must be replaced%0A-/+ resource "aws_ecs_task_definition" "app_task" {%0A      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_keyserver:61" -> (known after apply)%0A      ~ container_definitions    = (sensitive value) # forces replacement%0A      ~ id                       = "staging_keyserver" -> (known after apply)%0A      ~ revision                 = 61 -> (known after apply)%0A      - tags                     = {} -> null%0A        # (9 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.keystore_docdb.aws_docdb_cluster.docdb_primary must be replaced%0A-/+ resource "aws_docdb_cluster" "docdb_primary" {%0A      + apply_immediately               = (known after apply)%0A      ~ arn                             = "arn:aws:rds:eu-central-1:898587786287:cluster:staging-keyserver-keystore-docdb-primary-cluster" -> (known after apply)%0A      ~ availability_zones              = [%0A          - "eu-central-1a",%0A          - "eu-central-1b",%0A          - "eu-central-1c",%0A        ] -> (known after apply)%0A      + cluster_identifier_prefix       = (known after apply)%0A      ~ cluster_members                 = [%0A          - "staging-keyserver-keystore-docdb-primary-instance-0",%0A        ] -> (known after apply)%0A      ~ cluster_resource_id             = "cluster-IHQNJWC63NKRELS7LEYFYOE5KE" -> (known after apply)%0A      ~ db_cluster_parameter_group_name = "default.docdb5.0" -> (known after apply)%0A      ~ db_subnet_group_name            = "staging-keyserver-keystore-docdb-private-subnet-group" -> "staging-keyserver-keystore-docdb-new-private-subnet-group" # forces replacement%0A      - deletion_protection             = false -> null%0A      ~ endpoint                        = "staging-keyserver-keystore-docdb-primary-cluster.cluster-cnkvjbadm57i.eu-central-1.docdb.amazonaws.com" -> (known after apply)%0A      ~ engine_version                  = "5.0.0" -> (known after apply)%0A      ~ hosted_zone_id                  = "Z1ZKU8ZZR6T7FW" -> (known after apply)%0A      ~ id                              = "staging-keyserver-keystore-docdb-primary-cluster" -> (known after apply)%0A      ~ preferred_backup_window         = "22:12-22:42" -> (known after apply)%0A      ~ preferred_maintenance_window    = "sat:21:17-sat:21:47" -> (known after apply)%0A      ~ reader_endpoint                 = "staging-keyserver-keystore-docdb-primary-cluster.cluster-ro-cnkvjbadm57i.eu-central-1.docdb.amazonaws.com" -> (known after apply)%0A      - tags                            = {} -> null%0A      ~ vpc_security_group_ids          = [%0A          - "sg-01de29cd9149d5d29",%0A        ] -> (known after apply)%0A        # (11 unchanged attributes hidden)%0A    }%0A%0A  # module.keystore_docdb.aws_docdb_cluster_instance.docdb_instances[0] must be replaced%0A-/+ resource "aws_docdb_cluster_instance" "docdb_instances" {%0A      + apply_immediately            = (known after apply)%0A      ~ arn                          = "arn:aws:rds:eu-central-1:898587786287:db:staging-keyserver-keystore-docdb-primary-instance-0" -> (known after apply)%0A      ~ availability_zone            = "eu-central-1c" -> (known after apply)%0A      ~ ca_cert_identifier           = "rds-ca-2019" -> (known after apply)%0A      ~ cluster_identifier           = "staging-keyserver-keystore-docdb-primary-cluster" # forces replacement -> (known after apply) # forces replacement%0A      ~ db_subnet_group_name         = "staging-keyserver-keystore-docdb-private-subnet-group" -> (known after apply)%0A      ~ dbi_resource_id              = "db-GF34S7DWNQQBQUS4WCMKJKNQSA" -> (known after apply)%0A      ~ endpoint                     = "staging-keyserver-keystore-docdb-primary-instance-0.cnkvjbadm57i.eu-central-1.docdb.amazonaws.com" -> (known after apply)%0A      ~ engine_version               = "5.0.0" -> (known after apply)%0A      ~ id                           = "staging-keyserver-keystore-docdb-primary-instance-0" -> (known after apply)%0A      + identifier_prefix            = (known after apply)%0A      ~ kms_key_id                   = "arn:aws:kms:eu-central-1:898587786287:key/49f8d68a-cc29-477d-bdf4-7a9c3597566e" -> (known after apply)%0A      ~ port                         = 27017 -> (known after apply)%0A      ~ preferred_backup_window      = "22:12-22:42" -> (known after apply)%0A      ~ preferred_maintenance_window = "fri:02:49-fri:03:19" -> (known after apply)%0A      ~ publicly_accessible          = false -> (known after apply)%0A      ~ storage_encrypted            = true -> (known after apply)%0A      - tags                         = {} -> null%0A      ~ writer                       = true -> (known after apply)%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.keystore_docdb.aws_docdb_subnet_group.new_private_subnets will be created%0A  + resource "aws_docdb_subnet_group" "new_private_subnets" {%0A      + arn         = (known after apply)%0A      + description = "Managed by Terraform"%0A      + id          = (known after apply)%0A      + name        = "staging-keyserver-keystore-docdb-new-private-subnet-group"%0A      + name_prefix = (known after apply)%0A      + subnet_ids  = [%0A          + "subnet-0851c91f1a82ece18",%0A          + "subnet-0f59998ee3eeb6b29",%0A          + "subnet-0fe665bde6c07d332",%0A        ]%0A      + tags_all    = {%0A          + "Application"      = "keyserver"%0A          + "Env"              = "staging"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "Name"             = "keyserver"%0A          + "ProvisionedBy"    = "Terraform"%0A        }%0A    }%0A%0A  # module.keystore_docdb.aws_docdb_subnet_group.private_subnets will be updated in-place%0A  ~ resource "aws_docdb_subnet_group" "private_subnets" {%0A        id          = "staging-keyserver-keystore-docdb-private-subnet-group"%0A        name        = "staging-keyserver-keystore-docdb-private-subnet-group"%0A      ~ subnet_ids  = [%0A          - "subnet-0851c91f1a82ece18",%0A          - "subnet-0f59998ee3eeb6b29",%0A          - "subnet-0fe665bde6c07d332",%0A          + "subnet-006f9fc131af3565e",%0A          + "subnet-05894f2d41c0e8b45",%0A          + "subnet-06557bf48886434f1",%0A        ]%0A        tags        = {}%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.keystore_docdb.aws_security_group.new_service_security_group will be created%0A  + resource "aws_security_group" "new_service_security_group" {%0A      + arn                    = (known after apply)%0A      + description            = "Allow ingress from the application"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "10.0.0.0/16",%0A                ]%0A              + description      = "Allow outbound traffic from the DocDB cluster"%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "10.0.0.0/16",%0A                ]%0A              + description      = "Allow inbound traffic to the DocDB cluster"%0A              + from_port        = 27017%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 27017%0A            },%0A        ]%0A      + name                   = "staging-keyserver-keystore-docdb-service"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags_all               = {%0A          + "Application"      = "keyserver"%0A          + "Env"              = "staging"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "Name"             = "keyserver"%0A          + "ProvisionedBy"    = "Terraform"%0A        }%0A      + vpc_id                 = "vpc-08d4ffa8940e11aa5"%0A    }%0A%0A  # module.keystore_docdb.aws_security_group.service_security_group must be replaced%0A-/+ resource "aws_security_group" "service_security_group" {%0A      ~ arn                    = "arn:aws:ec2:eu-central-1:898587786287:security-group/sg-01de29cd9149d5d29" -> (known after apply)%0A      ~ egress                 = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "10.0.0.0/16",%0A                ]%0A              - description      = "Allow outbound traffic from the DocDB cluster"%0A              - from_port        = 0%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "-1"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 0%0A            },%0A          + {%0A              + cidr_blocks      = [%0A                  + "10.192.0.0/16",%0A                ]%0A              + description      = "Allow outbound traffic from the DocDB cluster"%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      ~ id                     = "sg-01de29cd9149d5d29" -> (known after apply)%0A      ~ ingress                = [%0A          - {%0A              - cidr_blocks      = [%0A                  - "10.0.0.0/16",%0A                ]%0A              - description      = "Allow inbound traffic to the DocDB cluster"%0A              - from_port        = 27017%0A              - ipv6_cidr_blocks = []%0A              - prefix_list_ids  = []%0A              - protocol         = "tcp"%0A              - security_groups  = []%0A              - self             = false%0A              - to_port          = 27017%0A            },%0A          + {%0A              + cidr_blocks      = [%0A                  + "10.192.0.0/16",%0A                ]%0A              + description      = "Allow inbound traffic to the DocDB cluster"%0A              + from_port        = 27017%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 27017%0A            },%0A        ]%0A        name                   = "staging-keyserver-keystore-docdb-service"%0A      + name_prefix            = (known after apply)%0A      ~ owner_id               = "898587786287" -> (known after apply)%0A      - tags                   = {} -> null%0A      ~ vpc_id                 = "vpc-08d4ffa8940e11aa5" -> "vpc-09dce0b23af575478" # forces replacement%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.keystore_docdb.module.docdb-autoscaling.aws_cloudwatch_metric_alarm.main[0] will be updated in-place%0A  ~ resource "aws_cloudwatch_metric_alarm" "main" {%0A      ~ dimensions                = {%0A          - "DBClusterIdentifier" = "staging-keyserver-keystore-docdb-primary-cluster"%0A        } -> (known after apply)%0A        id                        = "staging-keyserver-docdb-autoscaling-0"%0A        tags                      = {}%0A        # (16 unchanged attributes hidden)%0A    }%0A%0A  # module.keystore_docdb.module.docdb-autoscaling.aws_lambda_function.main will be updated in-place%0A  ~ resource "aws_lambda_function" "main" {%0A        id                             = "staging-keyserver-docdb-autoscaling"%0A        tags                           = {}%0A        # (20 unchanged attributes hidden)%0A%0A      ~ environment {%0A          ~ variables = {%0A              - "cluster_identifier" = "staging-keyserver-keystore-docdb-primary-cluster"%0A              - "max_capacity"       = "6"%0A              - "min_capacity"       = "0"%0A            } -> (known after apply)%0A        }%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0APlan: 6 to add, 5 to change, 4 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Action: `pull_request`*